In [1]:
import pandas as pd
df = pd.DataFrame({'col1': [1,2,3,4], 'col2':[444, 555, 666, 444], 'col3':['abc', 'def', 'ghi', 'xyz']})

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [3]:
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

In [4]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['col2'].unique()

array([444, 555, 666])

In [6]:
df['col2'].nunique()

3

In [7]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [8]:
def comp(x):
    return x ** 2 + 3
# df['col1_calculada'] = df['col1'].apply(comp)
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
df['col1_calculada'] = df['col1'].apply(lambda x: x**2 + 3)
df

   col1  col2 col3  col1_calculada
0     1   444  abc               4
1     2   555  def               7
2     3   666  ghi              12
3     4   444  xyz              19

In [10]:
df['col1'].sum()

np.int64(10)

In [11]:
df['col1'].mean()

np.float64(2.5)

In [12]:
df['col1'].product()

np.int64(24)

In [13]:
df['col1'].std()

np.float64(1.2909944487358056)

In [14]:
df['col1'].min()

np.int64(1)

In [15]:
df['col1'].max()

np.int64(4)

In [16]:
df['col1'].idxmax()

3

In [17]:
df['col1'].idxmin()

0

In [18]:
df[df['col2'] == 444]['col1_calculada'].sum()

np.int64(23)

In [19]:
df.sort_values(by='col2')

   col1  col2 col3  col1_calculada
0     1   444  abc               4
3     4   444  xyz              19
1     2   555  def               7
2     3   666  ghi              12

In [20]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
'B':['one', 'one', 'two', 'two', 'one', 'one'],
'C': ['x', 'y', 'x', 'y', 'x', 'y'],
'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [21]:
dict_map = {'one':1,'two':2}

In [22]:
df['E'] = df['B'].map(dict_map)

In [23]:
df[['A','B','D']]

     A    B  D
0  foo  one  1
1  foo  one  3
2  foo  two  2
3  bar  two  5
4  bar  one  4
5  bar  one  1

In [24]:
df.pivot_table(index='A',columns='B',values='D')

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0